[
    {
        "date": "30042020",
        "id": "1",
        "category": "announcements",
        "title": "Minteck Projects, mise à jour Polymer 3",
        "content": "<p>\n    Durant l'année 2019, Minteck Projects a reçu de nombreuses mises à jour majeures concernant la charte graphique et l'interface des différents sites. La prochaine mise à jour, nommée « Polymer 3 », est sans doute la plus grande jamais faite. \n<\/p>\n\n<h2>Petit point historique<\/h2>\n<p>\n    Voici un historique rapide des différentes versions du design des services de Minteck Projects :\n<\/p>\n<ul>\n        <li><b>Prerelease<\/b> : Site officiel avant le développement HTML, hébergé sur <a href=\"https:\/\/sites.google.com\" target=\"_blank\">Google Sites<\/a>.<\/li>\n        <li><b>Day One<\/b>, 21 décembre 2018 : Toute première version du site officiel 100% créé par Minteck Projects.<\/li>\n        <li><b>Polymer 1<\/b>, mars-avril 2019 : Nouveau logo, plus abstrait, et design plus « bleu ». Cette interface est celle qui est resté le plus longtemps en service.<\/li>\n        <li><b>Polymer 2<\/b>, décembre 2019 : Adaptation du logo de la mise à jour Polymer 1, initialement destiné à être des logos symboliques (pour des interfaces plus petites)<\/li>\n    <\/ul>\n\n<h2>Et Polymer 3, dans tout ça ?<\/h2>\n<p>Polymer 3 sera présent dans les versions suivantes respectivement pour les différents services :<\/p>\n<ul>\n    <li><b>Site officiel<\/b> : 6.0<\/li>\n    <li><b>Minteck Projects CMS<\/b> : 3.0<\/li>\n    <li><b>WebSpace<\/b> : 1.0<\/li>\n    <li><b>PinPages<\/b> : 20.06 Anniversary Update<\/li>\n    <li><b>OpenPlug<\/b> : 12<\/li>\n    <li><b>BetterSearch<\/b> : 2.0<\/li>\n    <li><b>BetterSearch:cloud<\/b> : 1.1<\/li>\n    <li><b>Nature<\/b> : 0.1<\/li>\n<\/ul>\n<small><b>*<\/b> Certains projets indiqués ici sortiront prochainement à partir de la diffusion de la mise à jour Polymer 3<\/small>\n\n<h2>En quoi Polymer 3 est une mise à jour particulière ?<\/h2>\n<p>\n    Polymer 3 est une mise à jour très spéciale, autant pour vous que pour nous. Cette mise à jour unifie l'interface entre tous les services afin d'avoir une meilleure consistance et cohérence entre les différents éléments.\n<\/p>\n<p>\n    Lors des mises à jour (indiquées ci-dessous), nous essayons de nous concentrer sur la nouvelle interface, les corrections de bugs, et nous ne prévoyons pas d'ajouter de nouvelles fonctionnalités.\n<\/p>\n\n<h2>Comment sera déployée la mise à jour Polymer 3 ?<\/h2>\n<p>\n    Comme l'indique <a href=\"http:\/\/pinpages.alwaysdata.net\/page\/?lang=fr&user=Minteck%20Projects#9\" target=\"_blank\">ce post sur PinPages<\/a>, nous prévoyons une opération de maintenance d'une durée <b>maximale<\/b> de 48 heures sur <b>tout le réseau<\/b>. Nous en profiterons aussi pour faire du ménage et redémarrer les serveurs.\n<\/p>\n<p>La mise à jour sera donc appliquée globalement sur tous les services. C'est une bonne idée pour éviter d'altérer l'expérience utilisateur, mais ça peut retarder considérablement la sortie de la mise à jour, étant donné qu'il faut mettre à jour tous les services<\/p>"
    }
]